{
  "backend/main.mo": "Defines story, user, comment, and report types plus sorting and distance utilities, with storage mixins and logic for comparing and locating stories.",
  "feature_evidence.json": "Contains feature traceability data mapping feature IDs to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of all major frontend files describing their roles in UI, logic, and backend integration.",
  "frontend/index.css": "Tailwind base configuration defining CSS variables for light/dark themes and global styling for the frontend.",
  "frontend/index.html": "HTML entry point loading the React app with geolocation permissions policy and root mount container.",
  "frontend/src/App.tsx": "Main React app managing authentication, view routing, UI interactivity guard, and profile setup flow.",
  "frontend/src/components/CreateStoryDialog.tsx": "Story creation dialog supporting drafts, manual or automatic location, image upload, and full form state management.",
  "frontend/src/components/CreateStoryFAB.tsx": "Floating action button that triggers story creation via a stylized plus button.",
  "frontend/src/components/DistanceKmSlider.tsx": "Reusable slider component for selecting distance in kilometers with optional disabled state and helper text.",
  "frontend/src/components/FilterBar.tsx": "Renders category filter buttons allowing users to switch between story categories.",
  "frontend/src/components/Footer.tsx": "Shows a simple footer with a copyright notice and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays navigation, theme toggle, and authentication controls with admin options when applicable.",
  "frontend/src/components/MapView.tsx": "Interactive Leaflet-based map with marker clustering, search, and story selection handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to choose a username and save their profile.",
  "frontend/src/components/SortControl.tsx": "Dropdown for selecting story sorting options such as newest or most liked.",
  "frontend/src/components/StoryCard.tsx": "Card displaying a story preview with actions for liking, pinning, commenting, and sharing.",
  "frontend/src/components/StoryDetailDialog.tsx": "Dialog showing full story details with comments, interactions, reporting, editing, and admin actions.",
  "frontend/src/components/StoryFeed.tsx": "Grid listing stories using StoryCard with loading and empty states.",
  "frontend/src/components/WallpaperSettingsDialog.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/env.d.ts": "Type definitions for Vite environment variables.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useDrafts.ts": "Provides React Query hooks to list, fetch, create, and update story drafts using the authenticated backend actor.",
  "frontend/src/hooks/useGeolocationPermission.ts": "Manages geolocation permission state, diagnostics, and location requests with secure-context and browser support checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Wraps Internet Identity auth client, exposing identity, login/logout, status flags, and an authentication provider.",
  "frontend/src/hooks/useQueries.ts": "Offers assorted React Query hooks for user profiles, stories, admin checks, and other backend interactions.",
  "frontend/src/hooks/useReverseGeocodedPlace.ts": "Fetches and returns a human-readable place name for given coordinates with loading and error state.",
  "frontend/src/hooks/useWallpaper.ts": "Empty file with no implementation.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode overrides, and layout-related utility rules.",
  "frontend/src/lib/categories.ts": "Provides mapping functions to get display labels and colors for story categories.",
  "frontend/src/lib/distanceFilterDebug.ts": "Provides opt-in debug logging for distance filtering, exposing helpers to enable, disable, and log filter decisions via localStorage.",
  "frontend/src/lib/locationFilter.ts": "Checks whether a story is within a given radius using Haversine distance and triggers optional debug logging.",
  "frontend/src/lib/locationPermissionCopy.ts": "Defines UI text for various geolocation permission states and provides a helper to retrieve the correct copy.",
  "frontend/src/lib/reverseGeocode.ts": "Performs reverse geocoding via Nominatim with caching and fallbacks, extracting a concise place name from responses.",
  "frontend/src/lib/storySorting.ts": "Implements multiple story-sorting strategies including newest, nearest, and popularity-based, and maps them to backend sort options.",
  "frontend/src/lib/utils.ts": "Utility helpers for class merging, distance calculation, and formatting distance/location strings.",
  "frontend/src/lib/wallpaperValidation.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AdminModerationPage.tsx": "Admin-only dashboard for viewing, dismissing, and acting on story reports with story detail viewing support.",
  "frontend/src/pages/HomePage.tsx": "Main user-facing page managing feed/map views, story creation, location permissions, filtering, and sorting logic.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page component showing posted, liked, and pinned stories with tabbed navigation and a shared story grid renderer.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and container settings with plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing existing features, pending requests, and versioned project state."
}