{
  "backend/main.mo": "Defines core types and logic for stories, users, sorting, distance calculation, and includes mixins for storage and authorization.",
  "backend/migration.mo": "Provides a migration that adds an optional image field to stored local updates, transforming old data to the new format.",
  "feature_evidence.json": "Lists features, related files, components, and test IDs for build and functionality tracking.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files and components for reference.",
  "frontend/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that loads the React application and sets geolocation permissions.",
  "frontend/src/App.tsx": "Main React app component handling authentication, view routing, interactivity guards, and global providers.",
  "frontend/src/components/CreateStoryDialog.tsx": "Dialog component for creating stories with fields, image upload, location handling, and draft management.",
  "frontend/src/components/CreateStoryFAB.tsx": "Floating action button that triggers the create‑story dialog.",
  "frontend/src/components/DistanceKmSlider.tsx": "Slider UI for selecting a distance in kilometers with optional helper text.",
  "frontend/src/components/FilterBar.tsx": "Category filter bar allowing users to filter stories by predefined categories.",
  "frontend/src/components/Footer.tsx": "Simple footer showing credits and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with authentication, theme toggle, admin/profile menus, and navigation options.",
  "frontend/src/components/local-updates/CreateLocalUpdateDialog.tsx": "Form dialog for creating a local update with category, radius, content, and optional image upload, using geolocation.",
  "frontend/src/components/local-updates/LocalUpdateDetailDialog.tsx": "Dialog showing full details of a local update with image, metadata, relevance info, and delete controls for author/admin.",
  "frontend/src/components/local-updates/LocalUpdateSettingsDialog.tsx": "Dialog for toggling notification muting per local update category.",
  "frontend/src/components/local-updates/LocalUpdatesFAB.tsx": "Floating action button that triggers creation of a new local update.",
  "frontend/src/components/local-updates/LocalUpdatesList.tsx": "Renders a list of local updates with relevance highlighting, images, metadata, and click handling. Computes time, distance, and category formatting for each update.",
  "frontend/src/components/local-updates/LocalUpdatesMapView.tsx": "Displays local updates on a Leaflet map with dynamically loaded assets, markers, and selection handling. Centers on user location and updates markers when data changes.",
  "frontend/src/components/MapView.tsx": "Leaflet‑based interactive map that loads markers, clustering, geosearch, and handles story/location selection.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to set a username and save their profile.",
  "frontend/src/components/SortControl.tsx": "Dropdown control for selecting story sorting options such as newest or nearest.",
  "frontend/src/components/StoryCard.tsx": "Displays a story preview with image, metadata, location, and interactive like/pin/share actions.",
  "frontend/src/components/StoryDetailDialog.tsx": "Dialog for viewing, editing, interacting with, and moderating a story, including comments, likes, reports, pins, and image handling.",
  "frontend/src/components/StoryFeed.tsx": "Displays a grid of StoryCard components with loading and empty states, supporting optional location-based messaging.",
  "frontend/src/components/WallpaperSettingsDialog.tsx": "Dialog for selecting, previewing, applying, or removing a custom wallpaper image with validation and file handling.",
  "frontend/src/env.d.ts": "Defines Vite environment variable typings for the frontend build. Extends ImportMeta and ImportMetaEnv for VITE-prefixed variables.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes. Supports authenticated and anonymous actor creation with access control initialization.",
  "frontend/src/hooks/useDrafts.ts": "Provides React Query hooks to list, fetch, create, and update story drafts using the backend actor. Handles identity state, errors, cache invalidation, and user feedback via toasts.",
  "frontend/src/hooks/useForegroundLocationTracking.ts": "Tracks the user's foreground location using watchPosition with a polling fallback. Exposes location, errors, tracking state, timestamps, and manual refresh.",
  "frontend/src/hooks/useGeolocationPermission.ts": "Manages geolocation permission state, diagnostics, and location requests, handling permission APIs, secure context checks, and browser support detection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity auth, including login, logout, status tracking, and loading identities from storage.",
  "frontend/src/hooks/useLocalUpdateMuting.ts": "Manages muted local update categories with localStorage persistence and exposes toggle and check utilities.",
  "frontend/src/hooks/useLocalUpdateNotifications.ts": "Watches local updates and user location to trigger system or toast notifications for relevant unmuted updates.",
  "frontend/src/hooks/useLocalUpdates.ts": "Provides React Query hooks to create and fetch local updates via the backend actor with automatic cache invalidation and toast feedback.",
  "frontend/src/hooks/useQueries.ts": "Defines various React Query hooks for user profiles, admin checks, stories, comments, reports, and other backend interactions with identity awareness.",
  "frontend/src/hooks/useReverseGeocodedPlace.ts": "Fetches and returns a place name for given coordinates using reverse geocoding with loading and error states.",
  "frontend/src/hooks/useWallpaper.ts": "Manages wallpaper selection, persistence, and removal using data URLs stored in localStorage.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark modes, and base layout and overlay interaction styles.",
  "frontend/src/lib/categories.ts": "Maps story categories to display labels and Tailwind color classes.",
  "frontend/src/lib/distanceFilterDebug.ts": "Provides opt‑in console debug logging utilities for distance filtering decisions.",
  "frontend/src/lib/localUpdates.ts": "Handles local update category labels/colors, distance-based relevance checks, and formatting helpers.",
  "frontend/src/lib/locationFilter.ts": "Filters stories by proximity using Haversine distance and optional debug logging.",
  "frontend/src/lib/locationPermissionCopy.ts": "Stores UI copy for various location-permission states and exposes a lookup helper.",
  "frontend/src/lib/reverseGeocode.ts": "Implements reverse‑geocoding via Nominatim with caching and fallback handling.",
  "frontend/src/lib/storySorting.ts": "Sorts stories by various criteria and converts frontend sort options to backend format.",
  "frontend/src/lib/utils.ts": "Provides class name merging, distance calculations, and distance/location formatting helpers.",
  "frontend/src/lib/wallpaperValidation.ts": "Validates wallpaper file uploads for size/type and exposes helpers for limits and labels.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider, loading App and global CSS.",
  "frontend/src/pages/AdminModerationPage.tsx": "Admin dashboard for viewing, dismissing, and acting on story reports, including story deletion and detail viewing.",
  "frontend/src/pages/HomePage.tsx": "Main feed and map view for browsing stories with filtering, sorting, location handling, and first-time-user intro logic.",
  "frontend/src/pages/LocalUpdatesPage.tsx": "Displays nearby local updates with list/map views, foreground location tracking, notifications, and creation/settings dialogs.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing posted, liked, and pinned stories with tab navigation and error/loading handling.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme colors, container settings, animations, and plugin setup.",
  "project_state.json": "Defines the project’s state, including deployment failure issues and feature work for adding optional image upload and rendering to Local Updates. Lists existing features, new requests, and metadata used for planning and fixes."
}