{
  "backend/main.mo": "Defines the backend actor with story, draft, user profile, and comment/report types, plus story comparison and distance-calculation utilities.",
  "backend/migration.mo": "Provides migration logic that adds optional locationName fields to stories and drafts by transforming old stored data into the new format.",
  "feature_evidence.json": "Contains feature evidence reports linking features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists prewritten summaries of various frontend source files and components for reference.",
  "frontend/index.css": "Defines Tailwind CSS base styles and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point that sets up the root element and loads the main frontend script.",
  "frontend/src/App.tsx": "Main React app component handling authentication, routing between views, runtime UI interactivity guard, and profile-setup logic.",
  "frontend/src/components/CreateStoryDialog.tsx": "A dialog component for creating or editing stories with fields for content, category, location, anonymity, images, and draft management.",
  "frontend/src/components/CreateStoryFAB.tsx": "A floating action button that triggers story creation when clicked.",
  "frontend/src/components/DistanceKmSlider.tsx": "A range slider for selecting a distance in kilometers with optional helper text and inactive mode.",
  "frontend/src/components/FilterBar.tsx": "A category filter bar allowing users to select or clear story category filters.",
  "frontend/src/components/Footer.tsx": "A simple footer displaying copyright info and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "A top navigation bar with branding, theme toggle, auth controls, and links to profile, admin, and local updates.",
  "frontend/src/components/local-updates/CreateLocalUpdateDialog.tsx": "Dialog for creating and submitting a local update with category, radius, text, and optional image.",
  "frontend/src/components/local-updates/LocalUpdateDetailDialog.tsx": "Displays full details of a local update with view tracking, thumbs-up, and optional deletion.",
  "frontend/src/components/local-updates/LocalUpdateSettingsDialog.tsx": "A dialog allowing users to mute or unmute local update categories using switches and visual icons.",
  "frontend/src/components/local-updates/LocalUpdatesFAB.tsx": "A floating action button that triggers creation of a new local update.",
  "frontend/src/components/local-updates/LocalUpdatesList.tsx": "Displays a list of local updates with relevance info, thumbnails, metadata, and thumbs‑up interactions.",
  "frontend/src/components/local-updates/LocalUpdatesMapView.tsx": "Renders a Leaflet-powered map showing update markers, user location, and selectable update details.",
  "frontend/src/components/LocationPickerDialog.tsx": "A dialog for selecting a geographic location via map interaction or geolocation fallback.",
  "frontend/src/components/MapView.tsx": "A Leaflet-based map showing story markers, user location, search, clustering, and selectable coordinates.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal prompting new users to choose and save a username before proceeding.",
  "frontend/src/components/SortControl.tsx": "A dropdown control letting users select sorting options such as newest, nearest, or most viewed.",
  "frontend/src/components/StoryCard.tsx": "Displays a story preview card with image, distance, and interactive like, pin, comment, and share actions.",
  "frontend/src/components/StoryDetailDialog.tsx": "Shows a detailed view of a story including likes, pins, comments, reporting, editing, and deletion options.",
  "frontend/src/components/StoryFeed.tsx": "Renders a grid of StoryCard components with loading and empty-state handling.",
  "frontend/src/components/WallpaperSettingsDialog.tsx": "Provides a dialog for selecting, previewing, applying, or removing a custom wallpaper image.",
  "frontend/src/env.d.ts": "Type definitions for Vite environment variables used in the frontend.",
  "frontend/src/hooks/useActor.ts": "React hook that initializes and manages the backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useDrafts.ts": "React hooks for listing, retrieving, creating, and updating story drafts through the backend actor.",
  "frontend/src/hooks/useForegroundLocationTracking.ts": "Provides foreground geolocation tracking with watchPosition and polling fallbacks, exposing location and errors.",
  "frontend/src/hooks/useGeolocationPermission.ts": "Provides a hook to manage geolocation permissions, track location state, handle errors, and request updates with diagnostics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a context and provider for Internet Identity authentication, managing login flow, stored identities, and status helpers.",
  "frontend/src/hooks/useLeafletMapResize.ts": "Auto-invalidates Leaflet map size when its container becomes visible or resizes using ResizeObserver and timed adjustments.",
  "frontend/src/hooks/useLocalUpdateMuting.ts": "Manages muted local update categories with localStorage persistence and helpers to toggle or check mute status.",
  "frontend/src/hooks/useLocalUpdateNotifications.ts": "Shows system or toast notifications for nearby local updates based on relevance, user location, and mute settings.",
  "frontend/src/hooks/useLocalUpdates.ts": "Provides React Query hooks to create and fetch local updates, including proximity and category filters, with error handling and cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks for user profiles, admin checks, stories, and other backend data with identity-aware loading states.",
  "frontend/src/hooks/useReverseGeocodedPlace.ts": "React hook that reverse‑geocodes coordinates and tracks loading, result, and errors with abort support.",
  "frontend/src/hooks/useWallpaper.ts": "Manages wallpaper state with localStorage persistence, allowing applying and removing image files as data URLs.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for themes and layout, including dialog and app container rules.",
  "frontend/src/lib/categories.ts": "Provides label and color mappings for story categories.",
  "frontend/src/lib/distanceFilterDebug.ts": "Debug utilities for logging distance‑based filtering decisions, toggleable via localStorage.",
  "frontend/src/lib/env.ts": "Typed helpers for reading Vite environment variables with optional fallbacks.",
  "frontend/src/lib/leafletLoader.ts": "Reference‑counted loader for Leaflet and MarkerCluster scripts and styles to prevent premature unloading.",
  "frontend/src/lib/localUpdates.ts": "Category metadata, distance checks, and relevance calculations for local updates.",
  "frontend/src/lib/locationFilter.ts": "Determines whether a story falls within a given radius, with optional debug logging.",
  "frontend/src/lib/locationPermissionCopy.ts": "Static UI copy for various location permission states with a helper to retrieve text.",
  "frontend/src/lib/reverseGeocode.ts": "Provides reverse geocoding via Nominatim with caching and fallback handling, returning concise place names.",
  "frontend/src/lib/startupValidation.ts": "Checks and logs configuration values like Internet Identity URL without blocking startup.",
  "frontend/src/lib/storySorting.ts": "Implements multiple story-sorting modes and maps frontend sort options to backend equivalents.",
  "frontend/src/lib/utils.ts": "Contains class name merging, Haversine distance calculation, and distance formatting helpers.",
  "frontend/src/lib/wallpaperValidation.ts": "Validates wallpaper file size and MIME type and exposes helper labels for limits and formats.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AdminModerationPage.tsx": "Admin dashboard to review, view, dismiss, and delete reported stories with permission checks.",
  "frontend/src/pages/HomePage.tsx": "Home feed and map view handling story browsing, creation, sorting, distance filtering, and geolocation state.",
  "frontend/src/pages/LocalUpdatesPage.tsx": "Displays nearby local updates with location tracking, muting, notifications, and list/map views.",
  "frontend/src/pages/ProfilePage.tsx": "React profile page that loads posted, liked, and pinned stories and displays them in tabbed grids with loading, error, and empty states.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and modifying hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, container settings, animations, and plugins.",
  "project_state.json": "Project state metadata describing existing features, new feature requests, and versioning for the location name field work."
}