{
  "backend/main.mo": "Defines story, user profile, comment, and report types plus sorting and distance utilities, with storage mixins for blob handling.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries of multiple frontend files describing their roles, behaviors, and key UI or logic features.",
  "frontend/index.css": "Defines Tailwind CSS base layers and theme variables for light and dark modes with custom color tokens.",
  "frontend/index.html": "Basic HTML entry file mounting the React app with geolocation permissions policy and script loader.",
  "frontend/src/App.tsx": "Root React component handling authentication, view routing, interactivity guards, and rendering of main pages.",
  "frontend/src/components/CreateStoryDialog.tsx": "Dialog for creating stories with fields, image upload, draft handling, location picking, and permission-aware logic.",
  "frontend/src/components/CreateStoryFAB.tsx": "Floating action button component that triggers story creation via a large gradient-styled button.",
  "frontend/src/components/DistanceKmSlider.tsx": "Simple range slider component for selecting distance in kilometers with optional helper text and inactive mode.",
  "frontend/src/components/FilterBar.tsx": "Renders category filter buttons and calls a callback when the selected category changes.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Provides the main app header with navigation, authentication handling, theme toggle, and user/admin menu.",
  "frontend/src/components/local-updates/CreateLocalUpdateDialog.tsx": "A dialog for creating a new local update with text, category, radius, and optional image upload. Validates input, processes images, handles location constraints, and submits updates via mutation.",
  "frontend/src/components/local-updates/LocalUpdateDetailDialog.tsx": "Displays details of a local update including image, metadata, relevance, and view counts, with actions for deleting and thumbs-up. Auto-increments view count on open and respects admin/author permissions.",
  "frontend/src/components/local-updates/LocalUpdateSettingsDialog.tsx": "Lets users toggle notification muting per local update category via switches. Uses stored muted-category state and presents each category with icon feedback.",
  "frontend/src/components/local-updates/LocalUpdatesFAB.tsx": "A floating action button that triggers creating a new local update. Styled prominently with a plus icon for quick access.",
  "frontend/src/components/local-updates/LocalUpdatesList.tsx": "Renders a scrollable list of local updates with relevance highlighting, media, metadata, and thumbs‑up interactions.",
  "frontend/src/components/local-updates/LocalUpdatesMapView.tsx": "Displays local updates on an interactive Leaflet map with category-colored markers and selection handling.",
  "frontend/src/components/LocationPickerDialog.tsx": "Dialog for selecting a location with geolocation support and map interaction, returning the chosen coordinates.",
  "frontend/src/components/MapView.tsx": "Leaflet-based map component that displays stories, handles clustering, searching, markers, and click interactions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter a username and saves the profile to the backend.",
  "frontend/src/components/SortControl.tsx": "Dropdown control that lets users choose how stories are sorted, with optional nearest-location disabling.",
  "frontend/src/components/StoryCard.tsx": "Card displaying a story preview with like, pin, view, and share actions, using user profile and location data.",
  "frontend/src/components/StoryDetailDialog.tsx": "Displays a detailed modal view of a story with actions like liking, commenting, reporting, editing, and deleting, including image handling and admin controls. Manages extensive local state and triggers queries/mutations for interactions.",
  "frontend/src/components/StoryFeed.tsx": "Shows a grid of StoryCard components or skeletons while loading. Handles empty states with location-aware messaging and triggers a callback when a story is clicked.",
  "frontend/src/components/WallpaperSettingsDialog.tsx": "Provides a dialog for selecting, previewing, applying, or removing a wallpaper image with validation and toast feedback. Manages file input, preview lifecycle, and wallpaper persistence via a custom hook.",
  "frontend/src/env.d.ts": "Defines Vite environment variable typings for frontend builds.",
  "frontend/src/hooks/useActor.ts": "Manages creation and lifecycle of a backend actor tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useDrafts.ts": "Provides hooks to list, fetch, create, and update user story drafts using the backend actor with React Query.",
  "frontend/src/hooks/useForegroundLocationTracking.ts": "Tracks foreground geolocation with watchPosition and polling fallback, exposing location, errors, and manual refresh.",
  "frontend/src/hooks/useGeolocationPermission.ts": "Handles geolocation permission state, diagnostics, and safe location requests with automatic rechecks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, loading stored identities, and handling login states via AuthClient.",
  "frontend/src/hooks/useLeafletMapResize.ts": "Hook that forces Leaflet maps to recalc size when they become visible or after container animations.",
  "frontend/src/hooks/useLocalUpdateMuting.ts": "Manages user-muted local update categories with localStorage persistence and provides mute toggling helpers.",
  "frontend/src/hooks/useLocalUpdateNotifications.ts": "Detects relevant nearby local updates and triggers system or in‑app notifications while avoiding duplicates.",
  "frontend/src/hooks/useLocalUpdates.ts": "Provides React Query hooks for creating and fetching local updates through the backend actor, with automatic cache invalidation and error handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, stories, admin checks, and other backend interactions using an authenticated actor.",
  "frontend/src/hooks/useReverseGeocodedPlace.ts": "Fetches a human‑readable place name from coordinates with loading and error tracking.",
  "frontend/src/hooks/useWallpaper.ts": "Manages a user-selected wallpaper, storing it as a data URL in localStorage and providing apply and remove functions.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes plus layout and dialog pointer-event overrides.",
  "frontend/src/lib/categories.ts": "Maps backend categories to user-facing labels and Tailwind color classes.",
  "frontend/src/lib/distanceFilterDebug.ts": "Provides optional console debug logging for distance-based filtering and exposes helpers on window.",
  "frontend/src/lib/env.ts": "Typed helpers for reading Vite environment variables with optional fallback.",
  "frontend/src/lib/leafletLoader.ts": "Manages dynamic loading and reference-counted reuse of Leaflet and MarkerCluster scripts and styles.",
  "frontend/src/lib/localUpdates.ts": "Category label/color utilities plus distance-based relevance checks for local updates.",
  "frontend/src/lib/locationFilter.ts": "Checks whether a story is within a given radius and logs debug info if enabled.",
  "frontend/src/lib/locationPermissionCopy.ts": "Defines UI text variants for different location-permission states.",
  "frontend/src/lib/reverseGeocode.ts": "Reverse‑geocodes coordinates via Nominatim with caching and graceful fallbacks.",
  "frontend/src/lib/startupValidation.ts": "Validates key environment config at startup and logs warnings without blocking.",
  "frontend/src/lib/storySorting.ts": "Provides functions to sort stories by various criteria and convert frontend sort options to backend format.",
  "frontend/src/lib/utils.ts": "Utility helpers for class merging, distance calculation, and formatting location or distance strings.",
  "frontend/src/lib/wallpaperValidation.ts": "Validates wallpaper file size and type and exposes helpers for size/type labels.",
  "frontend/src/main.tsx": "App entry point that sets up React Query and Internet Identity before rendering the main App.",
  "frontend/src/pages/AdminModerationPage.tsx": "Admin dashboard for viewing, dismissing, and deleting reported stories with story detail viewing support.",
  "frontend/src/pages/HomePage.tsx": "Main feed and map view page handling story discovery, location-based filtering, intro logic, and story creation dialog.",
  "frontend/src/pages/LocalUpdatesPage.tsx": "Displays local updates in list or map view, manages location tracking, notifications, muting, and update creation/settings.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page listing posted, liked, and pinned stories with loading, error states, and story detail handling.",
  "frontend/src/utils/urlParams.ts": "Helpers to read URL parameters, persist them in sessionStorage, and optionally clear them from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and containers with plugins like typography and container queries.",
  "project_state.json": "Project metadata tracking features, requests, and versions for the Local Updates Back button work."
}