{
  "backend/main.mo": "Motoko backend defining story, user, comment, and report types with map‑based storage, ID generators, authorization mixins, and public query helpers.",
  "feature_evidence.json": "Feature evidence report mapping two map‑click UI features to the affected MapView file and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind CSS base variables and dark‑mode theme definitions for global styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication state, profile setup flow, theme provider, and page layout.",
  "frontend/src/components/CreateStoryDialog.tsx": "Dialog for creating stories with geolocation, manual coordinates, image upload, anonymity options, and category selection.",
  "frontend/src/components/CreateStoryFAB.tsx": "Floating action button component that triggers opening the create‑story dialog.",
  "frontend/src/components/FilterBar.tsx": "Search and category filter UI for narrowing visible stories.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution with a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with branding, theme toggle, and Internet Identity login/logout controls.",
  "frontend/src/components/MapView.tsx": "Dynamically loads Leaflet and renders an interactive map with story markers, user location, and temporary pins on click. Manages marker state and map initialization.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to choose a username and save their profile via mutation. Provides a simple form with validation and submit handling.",
  "frontend/src/components/StoryCard.tsx": "Displays a story preview card with image, distance, category, and interaction buttons for liking, pinning, commenting, and sharing. Handles user authentication checks and mutation logic.",
  "frontend/src/components/StoryDetailDialog.tsx": "Full-screen dialog showing detailed story content, interactions, comments, reporting, and deletion. Manages likes, pins, comment submission, and loading states based on user identity.",
  "frontend/src/components/StoryFeed.tsx": "Renders a grid of StoryCard components or loading skeletons, with an empty state message when no stories exist. Handles story click forwarding.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor depending on Internet Identity state. Invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout methods, and initialization from storage. Wraps AuthClient to manage identity loading, delegation validation, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, stories, and intro state using a backend actor with retry and toast notifications.",
  "frontend/src/index.css": "Sets Tailwind base styles and CSS variables for light and dark themes using OKLCH color tokens.",
  "frontend/src/lib/categories.ts": "Provides helper functions that map story categories to display labels and Tailwind color classes.",
  "frontend/src/lib/utils.ts": "Contains a className merge helper, distance calculation utilities, and a formatter for human-readable distances.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/HomePage.tsx": "Implements the main home page with story feed/map views, filters, geolocation handling, and first‑time user logic.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors with OKLCH variables, custom radii, animations, and plugin integrations.",
  "project_state.json": "Contains project metadata, a high-level platform summary, and a detailed list of existing features with IDs, descriptions, and versions for build planning."
}