{
  "kind": "build_request",
  "title": "Make Local Updates Back button navigate to Home page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a user-visible \"Back\" button on the Local Updates page that navigates the user to the Home page when clicked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Give \"Back\" button in Local Updates to go to the home page."
        ]
      },
      "acceptanceCriteria": [
        "When the user is viewing Local Updates, a \"Back\" button is visible in the Local Updates UI.",
        "Clicking the \"Back\" button returns the user to the Home page view (same destination as existing Home navigation).",
        "The button label is in English and reads \"Back\" (or \"Back to Home\" if consistent with existing UI copy), and it is accessible (keyboard focusable and has appropriate semantics)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Wire Local Updates page navigation to the app-level view router so the Local Updates \"Back\" button can switch the current view to \"home\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Give \"Back\" button in Local Updates to go to the home page."
        ]
      },
      "acceptanceCriteria": [
        "Local Updates page receives a navigation callback from the top-level app (where view state is managed) and uses it for the \"Back\" button.",
        "No backend changes are required to navigate back to Home."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn UI components are read-only).",
    "Keep routing consistent with the existing app-level view state in frontend/src/App.tsx (no new routing framework)."
  ],
  "nonGoals": [
    "Add browser URL routing or deep links for Local Updates.",
    "Change any Local Updates fetching, notifications, muting, or map/list behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}