{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add optional location name to story creation and drafts",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an optional Location Name text input to CreateStoryDialog that is always editable and resets with the form.",
      "acceptanceCriteria": [
        "When the dialog is open, a clearly labeled optional input for location name is visible (English label and placeholder).",
        "User can type a location name and submit the story successfully with or without a value in this field.",
        "Closing and reopening the dialog resets the location name field along with the other form fields (consistent with current reset behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CreateStoryDialog.tsx",
          "operation": "modify",
          "description": "Add `locationName` state and an optional Input+Label (English label + placeholder like \"e.g., Central Park\") to the Share Your Story form. Ensure it stays enabled regardless of how coordinates are set (auto/manual/map picker), include it in resetForm(), and clear it on dialog close consistent with current reset behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Send the optional location name when creating a story so it is persisted and returned with stories.",
      "acceptanceCriteria": [
        "Backend Story type includes an optional locationName field, and createStory accepts an additional optional parameter for locationName.",
        "Creating a story with a location name and then fetching/searching the story returns the same locationName value.",
        "Creating a story without a location name continues to work and returns null/empty optional for locationName."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Extend `useCreateStory` (and any other create-story call sites in this file) to accept `locationName: string | null` and pass it through to the backend createStory call in the correct argument position (before coordinates), defaulting to null when not provided."
        },
        {
          "path": "frontend/src/components/CreateStoryDialog.tsx",
          "operation": "modify",
          "description": "Wire the new location name input into the create story submit flow by including `locationName` in the payload passed to `useCreateStory`, sending null/empty as appropriate so submitting works with or without a value."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Persist optional location name in story drafts across save/load/publish flows and restore it in CreateStoryDialog when a draft is loaded.",
      "acceptanceCriteria": [
        "Saving a draft stores the entered location name.",
        "Loading a saved draft repopulates the location name input with the stored value.",
        "Publishing a draft publishes the stored location name along with the story coordinates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useDrafts.ts",
          "operation": "modify",
          "description": "Update draft mutations (create/update via useCreateDraft/useUpdateDraft and the combined useSaveDraft wrapper) to accept `locationName: string | null` and pass it to backend draft create/update calls, defaulting to null when not provided."
        },
        {
          "path": "frontend/src/components/CreateStoryDialog.tsx",
          "operation": "modify",
          "description": "Include `locationName` in draft save payloads, restore it in `loadDraft()` from `draft.locationName`, and ensure publishing a draft uses the stored value by keeping it in local dialog state after loading and through publish/reset flows."
        }
      ]
    }
  ]
}