{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Local Updates back navigation to Home via app-level view state",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a visible, accessible Back button on Local Updates that returns the user to the Home view.",
      "acceptanceCriteria": [
        "When the user is viewing Local Updates, a \"Back\" button is visible in the Local Updates UI.",
        "Clicking the \"Back\" button returns the user to the Home page view (same destination as existing Home navigation).",
        "The button label is in English and reads \"Back\" (or \"Back to Home\" if consistent with existing UI copy), and it is accessible (keyboard focusable and has appropriate semantics)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LocalUpdatesPage.tsx",
          "operation": "modify",
          "description": "Add a Back/Back to Home button (use the existing shadcn Button component) to the Local Updates UI (e.g., near the Local Updates header) that calls a provided navigation callback; ensure it is a real <button> via the Button component and includes clear English label. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Pass an app-level navigation callback into Local Updates so the Back button switches the app view to home using existing view state routing.",
      "acceptanceCriteria": [
        "Local Updates page receives a navigation callback from the top-level app (where view state is managed) and uses it for the \"Back\" button.",
        "No backend changes are required to navigate back to Home."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire LocalUpdatesPage into the existing App-level view state by passing a navigation callback prop (e.g., onBackHome) that sets currentView to 'home', keeping routing consistent with the current view-state approach (no new routing framework)."
        },
        {
          "path": "frontend/src/pages/LocalUpdatesPage.tsx",
          "operation": "modify",
          "description": "Update LocalUpdatesPage to accept a navigation callback prop from App (e.g., onBackHome: () => void) and use it for the Back button action so it can switch the current view to 'home' without any backend involvement."
        }
      ]
    }
  ]
}