{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-06T08:58:09.190Z",
  "summary": "REQ-2 is largely implemented via a new reverse-geocode lib and hook with caching and abort-on-unmount. REQ-1 appears partially implemented (distance/place formatting utilities added and StoryCard now fetches placeName), but the fallback behavior for failed reverse geocoding does not match the requested/AC behavior based on the shown code.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "If reverse geocoding fails (or is loading), StoryCard should keep current behavior (distance-only if available, otherwise nothing) until/if a name becomes available, without surfacing an incorrect placeholder location name.",
      "reason": "The reverseGeocode() helper returns the literal string 'Unknown location' on non-abort errors, which would cause the UI to display a place label even when reverse geocoding failed, instead of falling back to the current behavior until a real name is available.",
      "evidence": [
        "frontend/src/lib/reverseGeocode.ts",
        "frontend/src/lib/utils.ts",
        "frontend/src/components/StoryCard.tsx"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Reverse geocoding returns a hardcoded fallback place name string ('Unknown location') on errors instead of indicating failure via null/empty and letting the UI fall back.",
      "reason": "The BuildRequest/AC specifies graceful fallback to existing behavior when reverse geocoding fails; it does not ask to display an 'Unknown location' label.",
      "evidence": [
        "frontend/src/lib/reverseGeocode.ts"
      ]
    },
    {
      "description": "Attempt to set a custom 'User-Agent' header on a browser fetch to Nominatim.",
      "reason": "Not requested in the BuildRequest; also typically not settable by browsers (may be ignored/blocked), making it an unrequested implementation detail.",
      "evidence": [
        "frontend/src/lib/reverseGeocode.ts"
      ]
    },
    {
      "description": "Updated documentation/state summary files describing unrelated features such as admin dashboard, moderation, story editing, and map search changes.",
      "reason": "These are not part of the requested scope (location name/distance in story feed + reverse geocoding).",
      "evidence": [
        "frontend-file-summaries.txt",
        "project_state.json"
      ]
    }
  ],
  "confidence": 0.66,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/src/components/StoryCard.tsx",
    "frontend/src/hooks/useReverseGeocodedPlace.ts",
    "frontend/src/lib/reverseGeocode.ts",
    "frontend/src/lib/utils.ts",
    "project_state.json"
  ]
}